export default {
  projections: {
    АгрегаторE: {
      а: {
        __caption__: 'А'
      },
      мастерАгрегат: {
        __caption__: ''
      },
      детейл1: {
        __caption__: 'Детейл1',
        а: {
          __caption__: 'А'
        },
        мастерДетейл1: {
          __caption__: 'Мастер детейл1',
          а: {
            __caption__: 'А'
          }
        },
        детейл2: {
          __caption__: 'Детейл2',
          а: {
            __caption__: 'А'
          }
        }
      }
    },
    АгрегаторL: {
      а: {
        __caption__: 'А'
      },
      мастерАгрегат: {
        __caption__: 'МастерА',
        а: {
          __caption__: 'МастерА'
        }
      }
    }
  },
  validations: {
    а: {
      __caption__: 'А'
    },
    мастерАгрегат: {
      __caption__: 'мастерАгрегат'
    },
    детейл1: {
      __caption__: 'Детейл1'
    }
  }
};
