export default {
  projections: {
    АгрегаторE: {
      а: {
        __caption__: 'а'
      },
      мастерАгрегат: {
        __caption__: 'мастерАгрегат'
      },
      детейл1: {
        __caption__: 'детейл1',
        а: {
          __caption__: 'а'
        },
        мастерДетейл1: {
          __caption__: 'мастерДетейл1',
          а: {
            __caption__: 'а'
          }
        },
        детейл2: {
          __caption__: 'детейл2',
          а: {
            __caption__: 'а'
          }
        }
      }
    },
    АгрегаторL: {
      а: {
        __caption__: 'а'
      },
      мастерАгрегат: {
        __caption__: 'мастерАгрегат',
        а: {
          __caption__: 'а'
        }
      }
    }
  },
  validations: {
    а: {
      __caption__: 'а'
    },
    мастерАгрегат: {
      __caption__: 'мастерАгрегат'
    },
    детейл1: {
      __caption__: 'детейл1'
    }
  }
};
